# ViewDisplayBackground Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackground Class
Members See Also
---
Set of values that control how background is drawn in a view. Background can only be set for a 3d view or for a section or elevation view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ViewDisplayBackground : IDisposable
```

Visual Basic
---
```text
Public Class ViewDisplayBackground _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ViewDisplayBackground : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ViewDisplayBackground
# See Also
ViewDisplayBackground Members
Autodesk.Revit.DB Namespace